var radio_ = [],
    judgment_ = [],
    checkbox_ = [],
    ABC_ = ["A", "B", "C", "D", "E"];
//单选题
radio_ = [
    [
        ["工程师上门收机需要客户做那些内容"], //问题
        [
            ["需要取消屏幕锁及苹果ID锁", 1],
            ["需要取消屏幕锁及苹果ID锁 取消屏幕锁", 0],
            ["填写完服务单就直接带回", 0]
        ]
    ],
    [
        ["需要取消屏幕锁的目的是什么"], //问题
        [
            ["方便工程师带回", 0],
            ["方便主板工程师检测", 1],
            ["没有必要取消", 0]
        ]
    ],
    [
        ["需要取消苹果ID的目的是什么"], //问题
        [
            ["以免资料丢失", 0],
            ["方便主板工程师检测", 0],
            ["以防客户忘记苹果ID", 1]
        ]
    ],
    [
        ["闪电修帽子摆放位置应该在"], //问题
        [
            ["背包里", 0],
            ["口袋里", 0],
            ["挂在背包的手提上", 1]
        ]
    ],
    [
        ["和客户见面时首先应该怎么做"],
        [
            ["递上工作证介绍自己", 1],
            ["直接进入客户家", 0],
            ["直接问客户在哪里维修手机", 0]
        ]
    ],
    [
        ["无法及时赶到客户处怎么处理"],
        [
            ["联系客户说晚点到让客户等自己", 0],
            ["直接到客户家里", 0],
            ["联系客户致歉并说明情况", 1]
        ]
    ],
    [
        ["上门服务时可以做"],
        [
            ["抽着烟去见客户", 0],
            ["穿运动鞋上门", 1],
            ["喷大量香水上门", 0]
        ]
    ],
    [
        ["工程师出发前应该怎么做"],
        [
            ["电话联系客户确认信息", 1],
            ["直接出门到客户家", 0],
            ["发短信给客户", 0]
        ]
    ],
    [
        ["工程师进入客户家后"],
        [
            ["自己找好地方就开始维修", 0],
            ["向客户征询适合的地点维修", 1],
            ["向客户收取维修费", 0]
        ]
    ],
    [
        ["工程师进客户家需要"],
        [
            ["向客户要鞋子换穿", 0],
            ["穿上鞋套", 1],
            ["戴上口罩", 0]
        ]
    ],
    [
        ["工程师在客户指定的位置首先应该"],
        [
            ["直接维修手机", 0],
            ["检测手机", 0],
            ["铺放维修垫并放置维修工具", 1]
        ]
    ],
    [
        ["维修服务单该怎么填写"],
        [
            ["在客户监测下边检测边填写", 1],
            ["维修好后再填写", 0],
            ["让客户自己填写", 0]
        ]
    ],
    [
        ["对于带有双面胶或保护膜的配件，工程师在安装配件之前"],
        [
            ["不检测直接撕毁", 0],
            ["先用客户机板进行检测，检测可用后撕毁", 1],
            ["检测不可用后小心撕毁", 0]
        ]
    ],
    [
        ["工程师未检测就直接撕毁，发现配件是损坏的，应该怎么处理"],
        [
            ["客户承担配件成本费用", 0],
            ["公司承担成本费用", 0],
            ["工程师承担成本费用", 1]
        ]
    ],
    [
        ["若由于工程师自身操作不当造成配件损坏"],
        [
            ["由工程师自行承担赔付费用", 1],
            ["向用户二次收取费用", 0],
            ["自己采购配件换上", 0]
        ]
    ],
    [
        ["若在维修过程中遇到难以确定的技术问题"],
        [
            ["自己凭感觉维修", 0],
            ["通知维修部主管，由维修部主管确认后处理", 1],
            ["向自己认识的人不是公司内部人员征询", 0]
        ]
    ],
    [
        ["在尝试更换配件后依然无法使用的主板故障"],
        [
            ["工程师应该与客户友好沟通，带回机器检测，再具体情况告知客户", 1],
            ["自己随便更换个配件就走了", 0],
            ["跟客户说不能维修了", 0]
        ]
    ],
    [
        ["维修垫使用过程中不能出现"],
        [
            ["在合适范围铺设工作垫", 0],
            ["工作垫必须平方整齐，不得出现折叠、褶皱", 0],
            ["存在破损、老旧、不洁等情况依旧继续使用", 1]
        ]
    ],
    [
        ["三脚架错误摆放方式"],
        [
            ["三脚架需放置在正前方", 0],
            ["其中两脚必须紧靠工作垫边缘", 0],
            ["摄像时可以让工作垫不在摄像范围内", 1]
        ]
    ],
    [
        ["工程师录制视频不应该"],
        [
            ["将手机调至飞行模式", 0],
            ["有拍摄到客户的手机就行了其他的不用管", 1],
            ["由客户进行确认后点击开始维修", 0]
        ]
    ],
    [
        ["工程师维修完成后首先"],
        [
            ["检测故障是否解决", 1],
            ["向收取客户现金", 0],
            ["让客户在微信付款", 0]
        ]
    ],
    [
        ["工程师维修完成并检测已维修好后"],
        [
            ["登录闪电修后台，选择维修方案，填入序列号，并且点击已完成", 1],
            ["向客户收取现金", 0],
            ["直接离开客户家里", 0]
        ]
    ],
    [
        ["维修并付款完成后不需要"],
        [
            ["让客户在微博宣传闪电修公司", 1],
            ["引导客户配文由客户自由发挥发到朋友圈", 0],
            ["发完后工程师为客户提供免费清洁手机并贴膜", 0]
        ]
    ],
    [
        ["工程上门前联系客户，客户没有接电话应该"],
        [
            ["直接回去不去客户家", 0],
            ["多联系几次不上后，短信告知客户自己来过，继续完成其他订单", 1],
            ["一直等客户", 0]
        ]
    ],
    [
        ["闪电修配件是"],
        [
            ["原厂品质", 1],
            ["原装配件", 0],
            ["自行生产", 0]
        ]
    ],
    [
        ["闪电修更换全屏的屏幕保修期"],
        [
            ["1年", 0],
            ["10年", 0],
            ["99年", 1]
        ]
    ],
    [
        ["闪电修的维修部在什么地方"],
        [
            ["深圳大学", 0],
            ["赛格广场", 1],
            ["宝安区", 0]
        ]
    ],
    [
        ["折价屏幕回收的屏幕用去哪里"],
        [
            ["自己加工后使用", 0],
            ["返厂加工", 1],
            ["直接当废品处理掉", 0]
        ]
    ],
    [
        ["不知道苹果ID密码可以正常使用吗"],
        [
            ["可以", 1],
            ["不可以", 0],
            ["刷机后可以", 0]
        ]
    ],
    [
        ["目前我们维修手机的品牌不包括"],
        [
            ["iPhone", 0],
            ["魅族", 1],
            ["华为", 0]
        ]
    ],
    [
        ["维修后手机出现问题联系闪电修不正确的方式"],
        [
            ["闪电修售后客服私人微信", 0],
            ["在QQ可以找到闪电客户", 1],
            ["闪电修微信公众号", 0]
        ]
    ],
    [
        ["客户询问手机配件需要更换时，工程师应该"],
        [
            ["私自向客户更换配件", 0],
            ["不跟客户更换配件", 0],
            ["引导客户在闪电修微信平台报修", 1]
        ]
    ],
    [
        ["外屏破碎内屏有瑕疵能不能不加工直接换新的屏幕"],
        [
            ["一定要加工维修", 0],
            ["不能折价只能换全屏", 1],
            ["可以折价换全屏", 0]
        ]
    ],
    [
        ["给用户检查手机后发现问题用户不愿意维修"],
        [
            ["强迫客户维修", 0],
            ["向客户收取30元检修费", 1],
            ["不向客户收取任何费用", 0]
        ]
    ],
    [
        ["闪电修客户寄修机器选择什么快递"],
        [
            ["顺丰快递", 0],
            ["EMS", 0],
            ["不指定快递公司", 1]
        ]
    ],
    [
        ["寄修的机器，客户的数据应该"],
        [
            ["由客户自己备份好", 1],
            ["工程师可以随意删除", 0],
            ["工程师可以随意传递查阅", 0]
        ]
    ],
    [
        ["客户认为手机维修价格太高不修了"],
        [
            ["强迫进行维修", 0],
            ["顺丰到付给客户寄回", 1],
            ["顺丰包邮给客户寄回", 0]
        ]
    ],
    [
        ["ID密码锁了，需要解ID，无法硬解的话"],
        [
            ["自行更换主板", 0],
            ["自行硬解", 0],
            ["不建议客户进行硬解和更换主板", 1]
        ]
    ],
    [
        ["手机耗电快的一般原因不包括"],
        [
            ["电池老化", 0],
            ["主板待机漏电", 0],
            ["音量键故障", 1]
        ]
    ],
    [
        ["手机为什么会经常性的发热的原因不包括"],
        [
            ["长时间玩游戏、看视频", 0],
            ["长时间通话也会导致基带部分发热", 0],
            ["手机尾插故障", 1]
        ]
    ],
    [
        ["手机不断自动亮屏可能的原因不包括"],
        [
            ["由于HOME按键和开机键工作不正常导致", 0],
            ["天气冷导致手机故障", 1],
            ["主板线路有短路现象", 0]
        ]
    ],
    [
        ["客户在订单上写能开机，收到设备是不开机的"],
        [
            ["联系客户和客户核实情况", 1],
            ["直接检测检修", 0],
            ["不维修修直接到付给客户", 0]
        ]
    ],
    [
        ["收到客户设备没有底部螺丝"],
        [
            ["螺丝是小零件不用跟客户核实", 0],
            ["联系客户和客户核实情况", 1],
            ["不维修修直接到付给客户", 0]
        ]
    ],
    [
        ["收到客户的手机设备显示屏无法显示的状态，无法进入系统应该怎么处理"],
        [
            ["沟通客户当做无法开机状态处理", 1],
            ["直接更换主板处理", 0],
            ["直接给客户刷机", 0]
        ]
    ],
    [
        ["工程师要带回客户手机一般维修好要多久"],
        [
            ["一般检测维修都是需要1-3个工作日左右时间", 1],
            ["一般检测维修都是需要5-7个工作日左右时间", 0],
            ["一般检测维修都是需要7-14个工作日左右时间", 0]
        ]
    ],
    [
        ["无相关配件可更换，如何沟通处理"],
        [
            ["向客户建议先寄回", 1],
            ["不寄回让客户等待配件", 0],
            ["不沟通用户直接寄回", 0]
        ]
    ],
    [
        ["设备第二次寄回来，故障点不一样"],
        [
            ["沟通客户属于二次维修", 1],
            ["直接给客户维修好", 0],
            ["沟通客户寄回手机", 0]
        ]
    ],
    [
        ["收到客户的设备没有卡托"],
        [
            ["卡托是小部件不需要问客户了", 0],
            ["自己给客户加个卡托", 0],
            ["联系客户和客户核实情况", 1]
        ]
    ],
    [
        ["收到的设备颜色跟客户在订单上填写的不相符"],
        [
            ["觉得是客户不小心写错了就算了", 0],
            ["联系该客户核实情况", 1],
            ["觉得客户故意的不给客户维修", 0]
        ]
    ],
    [
        ["客户设备外观上弯了，需要退机"],
        [
            ["告知客户维修有风险建议到官方付费渠道", 1],
            ["和客户联系说修不了了自己低价买下来", 0],
            ["不联系客户直接寄回给客户", 0]
        ]
    ],
    [
        ["手机屏幕失灵"],
        [
            ["沟通客户当不开机检测", 1],
            ["直接进行维修", 0],
            ["不维修给客户退回", 0]
        ]
    ],
    [
        ["设备无法激活检测功能"],
        [
            ["不维修给客户退回", 0],
            ["直接进行维修", 0],
            ["提前沟通客户当不开机检测", 1]
        ]
    ],
    [
        ["工程师带回手机涉及主板维修得机器该怎么办"],
        [
            ["工程师带回手机需要沟通不开机风险", 1],
            ["不需要沟通不开机风险", 0],
            ["不能维修", 0]
        ]
    ],
    [
        ["工程师带回手机主板有过维修历史怎么处理"],
        [
            ["可以直接维修", 0],
            ["沟通用户退机处理", 1],
            ["更换主板", 0]
        ]
    ],
    [
        ["工程师带回手机检测不出故障的机器怎么处理"],
        [
            ["沟通客户给客户寄回", 1],
            ["随便换个配件就说修好了", 0],
            ["一直放着等待故障出现", 0]
        ]
    ],
    [
        ["工程师带回手机检测出没有维修价值的机器（维修费用太高）"],
        [
            ["一定要客户维修", 0],
            ["建议客户不维修退回给客户", 1],
            ["直接说修不了了免得客户说不乐意给他维修", 0]
        ]
    ],
    [
        ["工程师带回手机检测设备存在客户描述之外的其他故障"],
        [
            ["跟客户核实情况，询问客户是否愿意维修", 1],
            ["修好后再跟客户说让客户付钱", 0],
            ["觉得客户不知道就不跟客户说", 0]
        ]
    ],
    [
        ["怎么判断设备检测进过液"],
        [
            ["防水标变红了", 1],
            ["主板烧了", 0],
            ["不开机", 0]
        ]
    ],
    [
        ["检测过程中发现客户的设备I2C数据总线被打了长螺丝"],
        [
            ["告知能会出现蓝屏重启的情况", 1],
            ["觉得小问题不用告知客户，直接维修", 0],
            ["觉得有风险不给客户修", 0]
        ]
    ],
    [
        ["客户需要开发票怎么办"],
        [
            ["不能开发票", 0],
            ["可以但需要支付3%的税费", 1],
            ["可以免费给客户开发票", 0]
        ]
    ],
    [
        ["闪电修开发票不能更改抬头"],
        [
            ["不能开发票", 0],
            ["可以更改抬头", 1],
            ["不能更改抬头", 0]
        ]
    ],
    [
        ["上门工程师遇到客户不愿带回配件的"],
        [
            ["强行带走客户配件", 0],
            ["和客户沟通公司需要带回配件对数以防止工程师刷单", 1],
            ["不和客户解释，不愿带走就不带走", 0]
        ]
    ],
    [
        ["客户需要看维修视频"],
        [
            ["不能给客户提供维修视频", 0],
            ["要客户付款才能提供", 0],
            ["可以提供视频给客户", 1]
        ]
    ],
    [
        ["三星S系列的手机拆装是从哪个部位开始的"],
        [
            ["拆装需要拆液晶", 0],
            ["先从液晶开始拆的，以免损坏客户的手机", 0],
            ["从后盖开始拆的", 1]
        ]
    ],
    [
        ["三星A系列的手机拆装是从哪个部位开始的"],
        [
            ["先从液晶开始拆的，以免损坏客户的手机", 1],
            ["从后盖开始拆的", 0],
            ["不能拆装维修", 0]
        ]
    ],
    [
        ["摔过的平板电脑，外壳变形的严重变形怎么处理"],
        [
            ["换上新的触摸可能会有点缝隙", 1],
            ["外壳变形是不能维修的", 0],
            ["只有更换外壳才能维修", 0]
        ]
    ],
    [
        ["iPhone6+手机液晶没有爆，完好的情况下，上面花屏，触摸不灵的情况是"],
        [
            ["一定是屏幕问题", 0],
            ["iPhone6+有通病一般是主板IC问题", 1],
            ["一定是主板问题", 0]
        ]
    ],
    [
        ["国产在装机的过程中会出现背光压伤是什么情况"],
        [
            ["拆机电池会出现变形或肿胀", 1],
            ["机器原本就有背光压伤", 0],
            ["机器出现新的故障", 0]
        ]
    ],
    [
        ["上门工程师遇到主板问题自己不会维修"],
        [
            ["告知客户自己不会维修让客户去找其他维修", 0],
            ["向客户解释带回公司由主板工程师维修", 1],
            ["告知客户主板问题是不能维修的", 0]
        ]
    ],

    [
        ["手机掉电严重，自检的方法"],
        [
            ["晚上睡觉前把电充满，然后关闭所有的后台程序，开启飞行模式，第二天早上看掉电量是多少，10%左右都属于正常的", 1],
            ["晚上睡觉前把电充满，然后关闭所有的后台程序，开启飞行模式，第二天早上看掉电量是多少，30%左右都属于正常的", 0],
            ["晚上睡觉前把电充满，然后关闭所有的后台程序，开启飞行模式，第二天早上看掉电量是多少，50%左右都属于正常的", 0]
        ]
    ],
    [
        ["客户第一次换了屏幕，现在出现蓝屏情况怎么首先确认"],
        [
            ["客户是否在闪电修维修更换了屏幕", 1],
            ["客户是否是恶意投诉的", 0],
            ["客户是否是竞争对手故意来电的", 0]
        ]
    ],
    [
        ["客户第一次换了屏幕，现在出现蓝屏如果是其他故障导致的"],
        [
            ["客户需要再次付费维修", 1],
            ["免费为客户更换一块新的屏幕", 0],
            ["不再给客户维修", 0]
        ]
    ],
    [
        ["客户第一次换了屏幕，现在出现蓝屏如果是人为导致的"],
        [
            ["客户需要再次付费维修", 1],
            ["免费为客户更换一块新的屏幕", 0],
            ["不再给客户维修", 0]
        ]
    ],
    [
        ["客户第一次换了屏幕，现在出现蓝屏如果是屏幕本身导致的"],
        [
            ["客户需要再次付费维修", 0],
            ["免费为客户更换一块新的屏幕", 1],
            ["不再给客户维修", 0]
        ]
    ],
    [
        ["维修视频保存期限为多少天"],
        [
            ["45", 0],
            ["30", 1],
            ["60", 0]
        ]
    ],
    [
        ["客户出现更换电池后充不了电的情况"],
        [
            ["建议客户先交叉测试充电头和数据线是否存在问题，确定充电配件没问题我们将会尽快安排工程师上门帮您检测您的设备", 1],
            ["建议客户先交叉测试充电头和数据线是否存在问题，确定充电配件没问题建议客户上门来检测", 0],
            ["建议客户先交叉测试充电头和数据线是否存在问题，确定充电配件没问题检测客户更换尾插", 0]
        ]
    ],
    [
        ["客户更换电池后出现电量充不满的情况"],
        [
            ["建议客户先更换数据线充电器排除数据线充电器问题", 1],
            ["建议客户到店更换电池", 0],
            ["安排工程师上门给客户更换电池", 0]
        ]
    ],
    [
        ["客户更换屏幕后出现花屏首先该排除"],
        [
            ["确认客户手机在更换完屏幕后是否受到过外力撞击或者挤压", 1],
            ["直接安排工程师给客户上门检测维修", 0],
            ["要求客户上门来检测机器的问题", 0]
        ]
    ],
    [
        ["更换屏幕后黑屏不显示首先该排除"],
        [
            ["排除没法开机导致黑屏", 1],
            ["排除主板故障", 0],
            ["排除屏幕故障", 0]
        ]
    ],
    [
        ["客户更换屏幕后出现像素点大小亮点几个以内属于正常"],
        [
            ["两个以内", 1],
            ["五个以内", 0],
            ["四个以内", 0]
        ]
    ],
    [
        ["师傅APP已经添加了备注，师傅在完成订单后，填写序列后下面有个备注，这个备注师傅必须填写"],
        [
            ["是否进水，是否有修过主板，是否有换过屏幕，是否有换过电池,如果没有就写无", 1],
            ["手机型号和颜色", 0],
            ["客户姓名手机号码", 0]
        ]
    ],
    [
        ["工程师按时到达客户家里，就必须在手机APP点击"],
        [
            ["开始接单", 0],
            ["开始维修", 1],
            ["开始录制", 0]
        ]
    ],
    [
        ["客户机器如果上门后发现是系统问题需带回来公司刷机升级，客户需支付要费用多少元"],
        [
            ["100元", 0],
            ["120元", 1],
            ["180元", 0]
        ]
    ],
    [
        ["凡是客户要求返厂加工的客户需要多支付"],
        [
            ["40元", 1],
            ["60元", 0],
            ["80元", 0]
        ]
    ],
    [
        ["工程师上门只是收机的情况是在APP点击"],
        [
            ["只填寄修带回", 1],
            ["寄修带回并填写维修方案", 0],
            ["只填维修方案", 0]
        ]
    ],
    [
        ["凡是扩容的机器，需要告知客户"],
        [
            ["系统都会升级到最新系统", 1],
            ["有可能导致开机不了的风险", 0],
            ["有可能出现白苹果的风险", 0]
        ]
    ],
    [
        ["更换屏幕四边出现灰角现象的屏幕情况"],
        [
            ["可以折价换屏", 0],
            ["屏幕不可以加工", 0],
            ["屏幕可以加工", 1]
        ]
    ],
    [
        ["手机屏幕手机出现漏液情况"],
        [
            ["可以折价换屏", 0],
            ["只能换全屏", 1],
            ["屏幕可以加工", 0]
        ]
    ],
    [
        ["手机屏幕屏幕背光有水印的情况"],
        [
            ["可以折价换屏", 0],
            ["屏幕不可以加工", 0],
            ["屏幕可以加工", 1]
        ]
    ],
    [
        ["手机屏幕屏幕背光漏光的情况"],
        [
            ["可以折价换屏", 0],
            ["屏幕不可以加工", 0],
            ["屏幕可以加工", 1]
        ]
    ],
    [
        ["手机屏幕背光有污渍的情况"],
        [
            ["可以用酒精拭擦", 1],
            ["不能用酒精拭擦", 0],
            ["可以用洗板水拭擦", 0]
        ]
    ],
    [
        ["手机屏幕出现内屏爆屏的情况"],
        [
            ["可以折价换屏", 0],
            ["只能换全屏", 1],
            ["屏幕可以加工", 0]
        ]
    ],
    [
        ["手机屏幕有触摸不良的情况"],
        [
            ["可以折价换屏", 0],
            ["屏幕可以加工", 0],
            ["只能换全屏", 1]
        ]
    ],
    [
        ["手机屏幕出现闪屏现象"],
        [
            ["只能换全屏", 1],
            ["屏幕可以加工", 0],
            ["可以折价换屏", 0]
        ]
    ],
    [
        ["工程师上门时使用的配件时"],
        [
            ["必须先检修没有问题才可以带上门", 1],
            ["不需先检修可以带上门", 0],
            ["需要多配备3套", 0]
        ]
    ],
    [
        ["给客户更换的配件背面有污渍情况"],
        [
            ["需要擦干净", 1],
            ["重新再换一个配件", 0],
            ["不能擦掉", 0]
        ]
    ],
    [
        ["iPhone4S，WiFi模块虚焊，在冬天的时候容易连接不上，根治的方法是"],
        [
            ["用电吹风加热一下就可以了", 0],
            ["加焊WiFi模块", 1],
            ["过了冬天自动就好了", 0]
        ]
    ],
    [
        ["iPhone4/4S无来电铃声一般情况"],
        [
            ["扬声器问题，需要更换扬声器", 0],
            ["主板问题，需要维修主板", 0],
            ["尾撬脏了或者进液需要更换尾插排线", 1]
        ]
    ],
    [
        ["iPhone5S/5C屏幕支架松动的情况怎么维修 "],
        [
            ["正常现象不需要维修", 0],
            ["用502胶粘支架或者更换支架", 1],
            ["更换全屏", 0]
        ]
    ],
    [
        ["工程师未能及时赶到客户家因该"],
        [
            ["委托其他人上门", 0],
            ["联系客户致歉并告诉原因", 1],
            ["直接不上门", 0]
        ]
    ],
    [
        ["工程师拒绝接单（未按时补充配件导致派单冲突情况）罚款多少"],
        [
            ["50元", 1],
            ["100元", 0],
            ["30元", 0]
        ]
    ],
    [
        ["工程师迟到未联系客户被客户投诉到公司的罚款"],
        [
            ["200元", 1],
            ["100元", 0],
            ["50元", 0]
        ]
    ],
    [
        ["上线后不接单，出现旷工罚款"],
        [
            ["50元", 1],
            ["100元", 0],
            ["60元", 0]
        ]
    ],
    [
        ["不服从公司工作安排，出现迟到罚款"],
        [
            ["50元", 1],
            ["20元", 0],
            ["100元", 0]
        ]
    ],
    [
        ["订单交易当天未进行现金代付罚款。"],
        [
            ["50元", 1],
            ["80元", 0],
            ["100元", 0]
        ]
    ],
    [
        ["接单后没有上门维修且无事通知公司安排其他工程师处理罚款"],
        [
            ["50元", 1],
            ["70元", 0],
            ["90元", 0]
        ]
    ],
    [
        ["工程师未填写维修服务单罚款。"],
        [
            ["50元", 1],
            ["60元", 0],
            ["30元", 0]
        ]
    ],
    [
        ["维修未贴保修标罚款"],
        [
            ["100元", 1],
            ["70元", 0],
            ["60元", 0]
        ]
    ],
    [
        ["更换电池未使用电池专用胶罚款"],
        [
            ["50元", 1],
            ["40元", 0],
            ["80元", 0]
        ]
    ],
    [
        ["更换下来的配件不带回且不上报主管罚款"],
        [
            ["50元", 1],
            ["100元", 0],
            ["70元", 0]
        ]
    ],
    [
        ["订单出现返修和售后问题（配件问题除外）罚款"],
        [
            ["10元", 1],
            ["20元", 0],
            ["30元", 0]
        ]
    ],
    [
        ["返厂加工屏幕后面未让客户在背光处签字罚款"],
        [
            ["50元", 1],
            ["40元", 0],
            ["10元", 0]
        ]
    ],
    [
        ["订单缺失录像或录像断续引发客户纠纷罚款"],
        [
            ["50元", 1],
            ["100元", 0],
            ["80元", 0]
        ]
    ],
    [
        ["不穿戴工作服，工牌，帽子，手环，穿拖鞋上班罚款"],
        [
            ["20元", 1],
            ["10元", 0],
            ["50元", 0]
        ]
    ],
    [
        ["不穿鞋套导致客户投诉罚款"],
        [
            ["20元", 1],
            ["30元", 0],
            ["40元", 0]
        ]
    ],
    [
        ["工程师身体存在异味，烟味，酒味，香水味过重被客户投诉罚款"],
        [
            ["20元", 1],
            ["30元", 0],
            ["50元", 0]
        ]
    ],
    [
        ["维修工作现场凌乱且残留电子垃圾导致客户投诉罚款"],
        [
            ["20元", 1],
            ["50元", 0],
            ["100元", 0]
        ]
    ],
    [
        ["态度恶劣导致客户投诉罚款。"],
        [
            ["50元", 1],
            ["30元", 0],
            ["10元", 0]
        ]
    ],
    [
        ["短信，电话，或当面羞辱，骚扰，威胁，纠缠客户，态度，恶劣导致客户投诉将如何处罚"],
        [
            ["终止合作", 1],
            ["100元", 0],
            ["200元", 0]
        ]
    ],
    [
        ["售后问题未上报公司罚款"],
        [
            ["80元", 1],
            ["60元", 0],
            ["50元", 0]
        ]
    ],
    [
        ["售后问题工程师24小时内未联系客户罚款"],
        [
            ["80元", 1],
            ["50元", 0],
            ["60元", 0]
        ]
    ],
    [
        ["工程师售后问题处理不到位导致客户投诉罚款"],
        [
            ["50元", 1],
            ["60元", 0],
            ["30元", 0]
        ]
    ],
    [
        ["工程师处理售后问题态度恶劣导致客户投诉罚款"],
        [
            ["50元", 1],
            ["60元", 0],
            ["70元", 0]
        ]
    ],
    [
        ["工程师自身原因导致的售后问题，带回公司由主板工程师处理的视为带回维修罚款"],
        [
            ["40元", 1],
            ["30元", 0],
            ["60元", 0]
        ]
    ],
    [
        ["委托非本公司工程师替代上门或私自带与平台无关人员上门维修罚款"],
        [
            ["终止合作", 1],
            ["200元", 0],
            ["100元", 0]
        ]
    ],
    [
        ["未按平台显示定价，私自篡改价格将罚款"],
        [
            ["终止合作", 1],
            ["100元", 0],
            ["200元", 0]
        ]
    ],
    [
        ["私自向客户额外收取其他费用罚款"],
        [
            ["终止合作", 1],
            ["100元", 0],
            ["200元", 0]
        ]
    ],
    [
        ["工程师越过闪电修平台与客户私下金钱交易将处罚"],
        [
            ["终止合作", 1],
            ["80元", 0],
            ["200元", 0]
        ]
    ],
    [
        ["工程师不使用闪电修提供的配件或偷换公司配发零件处罚"],
        [
            ["终止合作", 1],
            ["100元", 0],
            ["200元", 0]
        ]
    ],
    [
        ["泄露客户隐私，偷换客户原装配件处罚"],
        [
            ["终止合作", 1],
            ["100  ", 0],
            ["200", 0]
        ]
    ],
];
//判断题
judgment_ = [
    [
        ["下雨天上门服务可以穿拖鞋"],
        [0, 1]
    ],
    [
        ["工程师每天等客服派单就可以了，自己不用参与抢单"],
        [0, 1]
    ],
    [
        ["工程师接到订单后按时到达就可以了，中间不用联系客户"],
        [0, 1]
    ],
    [
        ["手机可以不调到飞行模式进行录制"],
        [0, 1]
    ],
    [
        ["工程师填写维修服务单时可以不按顺序检测填写"],
        [0, 1]
    ],
    [
        ["在配件更换过程中，工程师可以随意操作"],
        [0, 1]
    ],
    [
        ["若在维修过程中遇到难以确定的技术问题可以自行处理"],
        [0, 1]
    ],
    [
        ["带回客户的机器直接让主板工程师维修好带回给客户就可以了"],
        [0, 1]
    ],
    [
        ["维修垫存在破损、老旧等情况可以继续使用"],
        [0, 1]
    ],
    [
        ["摄像师工作垫有一部分不在录制范围内觉得没有问题可以继续录制"],
        [0, 1]
    ],
    [
        ["上门服务工程师带回的客户的机器可以什么都不贴以免弄脏客户手机"],
        [0, 1]
    ],
    [
        ["闪电修的配件是不保修的"],
        [0, 1]
    ],
    [
        ["闪电修所有配件保修期都是99年"],
        [0, 1]
    ],
    [
        ["iPhone手机不知道苹果ID密码不可以正常使用"],
        [0, 1]
    ],
    [
        ["闪电修提供ID解除服务"],
        [0, 1]
    ],
    [
        ["回收的屏幕我们是直接加工后使用"],
        [0, 1]
    ],
    [
        ["客户上门检测手机也需要收取30元检测费"],
        [0, 1]
    ],
    [
        [" 无相关配件可更换时可以把机器放着不管"],
        [0, 1]
    ],
    [
        ["设备无法激活检测功能的情况不能当不开机检测"],
        [0, 1]
    ],
    [
        ["涉及主板维修不需要沟通不开机风险"],
        [0, 1]
    ],
    [
        ["涉及主板维修得机器一律不得维修"],
        [0, 1]
    ],
    [
        ["没有维修价值的机器（维修费用太高）也要尽量让客户出钱维修"],
        [0, 1]
    ],
    [
        ["客户手机急用可以空运给客户"],
        [0, 1]
    ],
    [
        ["维修来回的邮费都是客户承担"],
        [0, 1]
    ],
    [
        ["无论什么情况客户只需要承担将故障设备邮寄给我们的相关快递费用"],
        [0, 1]
    ],
    [
        ["闪电修开发票不能更改抬头"],
        [0, 1]
    ],
    [
        ["三星A系列的手机，是先从后盖开始拆的，以免损坏客户的手机"],
        [0, 1]
    ],
    [
        ["苹果手机更换配件不需要拔掉电池座"],
        [0, 1]
    ],
    [
        ["mate7、mate8后壳弯曲不会屏幕出现压伤"],
        [0, 1]
    ],
    [
        ["维修的价格不能在微信上看到，需要向客户报价"],
        [0, 1]
    ],
    [
        ["闪电修的手机配件的都是从苹果公司购买的"],
        [0, 1]
    ],
    [
        ["维修完成后为简便不提出让客户发朋友圈"],
        [0, 1]
    ],
    [
        ["客户可以观看超过45天的维修视频"],
        [0, 1]
    ],
    [
        ["客户手机掉电严重，没有办法自检"],
        [0, 1]
    ],
    [
        ["更换的电池不耐用属于电池老化现象"],
        [0, 1]
    ],
    [
        ["（只针对iPhone）如果亮点在五个以内的话，是属于正常的情况。"],
        [0, 1]
    ],
    [
        ["工程师可以没到客户那里就点击开始维修"],
        [0, 1]
    ],
    [
        ["工程师完成订单后，客户收到完成订单信息，要让客户直接点信息网址进入支付"],
        [0, 1]
    ],
    [
        ["目前新系统支持改价功能，工程师可以擅自与客户协商优惠价格"],
        [0, 1]
    ],
    [
        ["刷机升级，如果客户愿意上公司来就是需要120元费用"],
        [0, 1]
    ],
    [
        ["客户机器如果上门后发现是系统问题需带回来公司刷机升级是免费刷机升级的"],
        [0, 1]
    ],
    [
        ["返厂加工屏幕的多收取的的40元是加工费用"],
        [0, 1]
    ],
    [
        ["返厂加工屏幕的情况是没有风险的可以不用和客户沟通"],
        [0, 1]
    ],
    [
        ["返厂加工的屏幕如果坏了，客户依然需要支付更换屏幕的费用"],
        [0, 1]
    ],
    [
        ["进水的机器，屏幕暂时可以显示的情况隔几天后不会再出现不能显示的情况"],
        [0, 1]
    ],
    [
        ["客户备用机在寄修客服处申领"],
        [0, 1]
    ],
    [
        ["屏幕出现漏液、爆屏、触摸不良、闪屏的情况可以折价处理"],
        [0, 1]
    ],
    [
        ["国产屏幕问题可以折价换屏"],
        [0, 1]
    ],
    [
        ["待机漏电，就是手机开机程序完成后，进入待机状态，电流表会归零。"],
        [0, 1]
    ],
    [
        ["工程师拆装机时不需要检测主板漏电"],
        [0, 1]
    ],
    [
        ["苹果手机扩容是不需要重新刷机的"],
        [0, 1]
    ],
    [
        ["客户屏幕带回加工的情况，就不需要给客户贴钢化膜"],
        [0, 1]
    ],
    [
        ["主板寄修手机后面，只需要有二维码就可以了，不需要再贴客户姓名和电话"],
        [0, 1]
    ],
    [
        ["iPhone4S，WiFi模块虚焊，在冬天的时候容易连接不上，只需要用电吹风加热就可以根治了"],
        [0, 1]
    ],
    [
        ["iPhone6/6+iPhone6/6+外壳硬度很好，拆装机时可以不用注意外壳问题"],
        [0, 1]
    ],
    [
        ["工程师可以不填写维修服务单"],
        [0, 1]
    ],
    [
        ["工程师可以把客户的原装配件偷换掉"],
        [0, 1]
    ],
    [
        ["工程师可以向客户收取路费"],
        [0, 1]
    ],
    [
        ["工程师上门可以不使用公司的配件"],
        [0, 1]
    ],
    [
        ["工程师上门前可以不给客户打电话直接到达"],
        [0, 1]
    ],
    [
        ["工程师可以不及时赶到客户家"],
        [0, 1]
    ],
    [
        ["客户支付现金的工程师可以隔几天再代付"],
        [0, 1]
    ],
    [
        ["工程师可以不填写维修服务单。"],
        [0, 1]
    ],
    [
        ["返厂加工屏幕后面未让客户在背光处签字罚款20元"],
        [0, 1]
    ],
    [
        ["维修过程可以中断录像"],
        [0, 1]
    ],
    [
        ["可以不穿戴工作服，工牌，帽子，手环，穿拖鞋上班"],
        [0, 1]
    ],
    [
        ["工程师身上有酒味可以上门"],
        [0, 1]
    ],
    [
        ["短信，电话，或当面羞辱，骚扰，威胁，纠缠客户，态度，恶劣导致客户投诉的 处罚200元"],
        [0, 1]
    ],
    [
        ["工程师售后问题处理不到位导致客户投诉罚款30元"],
        [0, 1]
    ],
    [
        ["工程师处理售后问题态度恶劣导致客户投诉罚款30元"],
        [0, 1]
    ],
    [
        ["可以委托非本公司工程师替代上门"],
        [0, 1]
    ],
    [
        ["上门前不可以喝大量的酒"],
        [1, 0]
    ],
    [
        ["工程师上岗后必须下载闪电修APP并注册成功后方可以接单"],
        [1, 0]
    ],
    [
        ["工程师检测时要用电流表进行漏电检测"],
        [1, 0]
    ],
    [
        ["工程师必须将电子废料带走并将活动现场清洁干净"],
        [1, 0]
    ],
    [
        ["闪电修以客户维修单号作为保修凭证"],
        [1, 0]
    ],
    [
        ["设备第二次寄回来，故障点不一样时属于二次维修情况"],
        [1, 0]
    ],
    [
        ["手机屏幕失灵的情况只能当不开机检测"],
        [1, 0]
    ],
    [
        ["主板有过维修历史的机器一律不得维修"],
        [1, 0]
    ],
    [
        ["检测不出故障的机器要给客户寄回"],
        [1, 0]
    ],
    [
        ["检测设备存在客户描述之外的其他故障，跟客户核实一下询问客户是否要维修"],
        [1, 0]
    ],
    [
        ["客户接受闪电修提供的维修方案，设备维修完成后寄回的维修费用将由闪电修承担"],
        [1, 0]
    ],
    [
        ["三星S系列的手机，拆装是不用拆液晶的，是从后盖开始拆的"],
        [1, 0]
    ],
    [
        ["国产机器，有很多是有导电双面胶，可以撕掉不要的"],
        [1, 0]
    ],
    [
        ["华为手机拆装时候注意，屏幕排线是在电池下面的"],
        [1, 0]
    ],
    [
        ["P9中框贴合会出现边角发黄过一会会消掉"],
        [1, 0]
    ],
    [
        ["客户维修优惠目前只有活动现场9折优惠，其余情况不打折！"],
        [1, 0]
    ],
    [
        ["客户需要更换备件，需要带回旧件到仓库兑换新件"],
        [1, 0]
    ],
    [
        ["用电流表夹在主板上马上就有电流反应是主板漏电问题"],
        [1, 0]
    ],
    [
        ["iPhone5/5S/5C拆装机时需要沟通支架分离风险"],
        [1, 0]
    ],
    [
        ["主板维修或上门维修和售后的问题，以及多次次上门维修的配件都需要贴闪电修的logo"],
        [1, 0]
    ],
    [
        ["iPhone6S、6S+外壳在空气潮湿的地方易氧化掉漆"],
        [1, 0]
    ],
    [
        ["iPhone5s指纹排线易扯断，拆屏幕时需要特别注意"],
        [1, 0]
    ],
    [
        ["收到客户的设备没有卡托应联系客户核实情况"],
        [1, 0]
    ],
    [
        ["工程师测试客户语音话题时，不能吹口哨等不文明举动"],
        [1, 0]
    ],
    [
        ["工程师给客户手机更换电池的维修项目需要测试20分钟"],
        [1, 0]
    ],
    [
        ["更换电池必须使用电池专用胶"],
        [1, 0]
    ],
    [
        ["工程师不能私自篡改价格"],
        [1, 0]
    ],
    [
        ["给客户更换的配件背面有污渍要擦干净"],
        [1, 0]
    ],
    [
        ["iPhone5S/5C拆下屏幕容易造成支架脱落"],
        [1, 0]
    ],
    [
        ["工程师拒绝接单（未按时补充配件导致派单冲突情况）会被处罚"],
        [1, 0]
    ],
    [
        ["工程师迟到未联系客户被客户投诉到公司的罚款200元"],
        [1, 0]
    ],
    [
        ["上线后不接单，视为旷工"],
        [1, 0]
    ],
    [
        ["不服从公司工作安排，出现迟到罚款50元"],
        [1, 0]
    ],
    [
        ["接单后没有上门维修且无事通知公司安排其他工程师处理的罚款50元"],
        [1, 0]
    ],
    [
        ["维修完成需贴保修标"],
        [1, 0]
    ],
    [
        ["更换电池需使用电池专用胶"],
        [1, 0]
    ],
    [
        ["更换下来的配件不带回需要上报主管"],
        [1, 0]
    ],
    [
        ["订单出现返修和售后问题（配件问题除外）罚款10元"],
        [1, 0]
    ],
    [
        ["不穿鞋套导致客户投诉罚款50元"],
        [1, 0]
    ],
    [
        ["维修工作现场凌乱且残留电子垃圾导致客户投诉罚款20元"],
        [1, 0]
    ],
    [
        ["态度恶劣导致客户投诉的罚款50元"],
        [1, 0]
    ],
    [
        ["售后问题工程师24小时内需联系客户"],
        [1, 0]
    ],
    [
        ["工程师需按售后流程处理售后客户"],
        [1, 0]
    ],
    [
        ["工程师自身原因导致的售后问题，带回公司由主板工程师处理的视为带回维修"],
        [1, 0]
    ],
    [
        ["未按平台显示定价，私自篡改价格的，公司将终止合作"],
        [1, 0]
    ],
    [
        ["私自向客户额外收取其他费用的，公司将终止合作"],
        [1, 0]
    ],
    [
        ["工程师越过闪电修平台与客户私下金钱交易的，公司将终止合作"],
        [1, 0]
    ],
    [
        ["工程师不使用闪电修提供的配件或偷换公司配发零件的，公司将终止合作"],
        [1, 0]
    ],
    [
        ["泄露客户隐私，偷换客户原装配件的，公司将终止合作"],
        [1, 0]
    ]
];
//多选题
checkbox_ = [
    [
        ["上门服务必须穿戴的装备（）"], //问题
        [
            ["工作服", 1],
            ["工作证", 1],
            ["运动鞋", 0],
            ["工具包", 1]
        ]
    ],
    [
        ["客户的付款方式有哪些"], //问题
        [
            ["直接在微信公众号上付款", 1],
            ["银行卡转账给公司账户", 0],
            ["工程师代付", 1],
            ["使用京东白条", 0]
        ]
    ],
    [
        ["iPhone手机屏幕内爆可能出现什么问题"],
        [
            ["系统升级", 0],
            ["花屏", 1],
            ["触摸不灵", 1],
            ["闪白条", 1]
        ]
    ],
    [
        ["客户更换电池后出现电量充不满，重启后电量显示无变化"],
        [
            ["可能排线故障", 1],
            ["电池故障", 1],
            ["屏幕故障", 0],
            ["主板充电线路故障", 1]
        ]
    ],
    [
        ["客户更换电池后出现电量充不满，重启有电量显示但充电时无电量变化，重启后显示电量满"],
        [
            ["按键音问题", 0],
            ["外配问题", 1],
            ["主板电池检测线路故障", 1],
            ["可能是电池数据检测", 1]
        ]
    ],
    [
        ["更换屏幕后出现闪屏、触摸不灵可能是什么情况"],
        [
            ["如果是充电的时候出现有可能是静电导致的", 1],
            ["如果是日常使用中偶尔出现一次属于正常", 1],
            ["可能是电池故障导致的", 0],
            ["有可能是尾插故障导致的", 0]
        ]
    ],
    [
        ["工程师出门准备必须"],
        [
            ["必须向区域主管告知自己准备出门", 0],
            ["核对订单与客户联系上门时间", 1],
            ["先和公司确认客户地址", 0],
            ["配件必须齐全无误", 1]
        ]
    ],
    [
        ["主板漏电一般情况是"],
        [
            ["开机大电流，就是开机电流比正常机器大，工作电流也比其他手机大", 1],
            ["待机漏电，就是手机开机程序完成后，进入待机状态，电流表不会归零", 1],
            ["夹电漏电，即使用电流表夹在主板，马上就有电流反应", 1],
            ["接触手机时没有任何反应，并且有电流的声音", 0]
        ]
    ],
    [
        ["工程师进客户家需要"],
        [
            ["递上工作证介绍自己", 1],
            ["穿上鞋套", 1],
            ["带上口罩", 0],
            ["要客户询问适合维修的地方", 1]
        ]
    ],
    [
        ["维修垫铺放应该"],
        [
            ["在合适范围铺设工作垫", 1],
            ["存在破损、老旧、不洁等情况依旧可以使用", 0],
            ["若存在破损、老旧、不洁等情况请及时到总部更换。", 1],
            ["工作垫必须平方整齐，不得出现折叠、褶皱", 1]
        ]
    ],
    [
        ["三脚架摆放应该"],
        [
            ["三脚架需放置在正前方", 1],
            ["其中两脚必须紧靠工作垫边缘", 1],
            ["摄像时候只要能拍到客户手机就可了，不需要保证工作垫被全部录制范围内", 0],
            ["摄像时候要保证工作垫被全部录制范围内", 1]
        ]
    ],
    [
        ["工程师录制规范"],
        [
            ["手机调至静音模式", 0],
            ["固定好手机确保工作垫的四个边缘角处于手机的拍摄范围内", 1],
            ["录制应从对照服务单检测开始到维修完成后对照服务单检测无故障后结束", 1],
            ["将手机调至飞行模式", 1]
        ]
    ],
    [
        ["工程师维修并且检测完成后"],
        [
            ["登录闪电修后台，选择维修方案，填入序列号，并且点击已完成", 1],
            ["提醒客户在微信付款", 1],
            ["向客户收取现金", 0],
            ["向客户推荐发朋友圈推广", 1]
        ]
    ],
    [
        ["维修并付款完成后需要"],
        [
            ["引导客户在公众号回复“二维码”及“工牌号”保存至手机", 1],
            ["向客户提供发票", 0],
            ["发完后工程师为客户提供免费清洁手机并贴膜", 1],
            ["引导客户配文由客户自由发挥发到朋友圈", 1]
        ]
    ],
    [
        ["目前我们维修手机的品牌包括"],
        [
            ["iPhone", 1],
            ["小米", 1],
            ["华为", 1],
            ["三星", 1]
        ]
    ],
    [
        ["维修后手机出现问题怎么联系闪电修"],
        [
            ["闪电修售后客服私人微信（shandianxiu1010）", 1],
            ["打售后电话400-900-5255", 1],
            ["在QQ平台上联系闪电修客服", 0],
            ["闪电修微信公众号", 1]
        ]
    ],
    [
        ["手机耗电快的一般原因"],
        [
            ["电池老化", 1],
            ["手机屏幕不匹配", 0],
            ["主板待机漏电", 1],
            ["运行电流偏大", 1]
        ]
    ],
    [
        ["手机为什么会经常性的发热"],
        [
            ["长时间待机不使用", 0],
            ["长时间通话也会导致基带部分发热", 1],
            ["长时间玩游戏、看视频", 1],
            ["进水设备发热可能是部分功能工作不正常导致主板大电流而引起发热", 1]
        ]
    ],
    [
        ["手机不断自动亮屏可能的原因"],
        [
            ["由于HOME按键和开机键工作不正常导致", 1],
            ["按键自动工作", 1],
            ["主板线路有短路现象", 1],
            ["手机后壳破损", 0]
        ]
    ],
    [
        ["客户第一次换了屏幕，现在出现蓝屏情况怎么处理"],
        [
            ["确认客户是否在闪电修维修更换了屏幕", 1],
            ["确认客户的屏幕是否是非人为问题", 1],
            ["确认客户手机的购买渠道", 0],
            ["确认是否是其他故障导致的", 1]
        ]
    ],
];
